# file location: ${HOME}/Brewfile

tap 'azure/functions'
tap 'nikitabobko/tap'
tap 'romkatv/powerlevel10k'
tap 'TheBoredTeam/boring-notch' if ::OS::Mac::version >= 14
tap 'sst/tap'

brew 'ansible'
brew 'awscli'
brew 'bash'
brew 'curl'
brew 'diff-so-fancy'
brew 'direnv'
brew 'eza'
brew 'fzf'
brew 'gh'
brew 'gimme-aws-creds'
brew 'git'
brew 'git-extras'
brew 'git-tools'
brew 'git-gui'
brew 'http-server'
brew 'jq'
brew 'kcat'
brew 'less'
brew 'libfido2'
brew 'libidn2'
brew 'libpq'
brew 'libssh'
brew 'mise'
brew 'neovim'
brew 'opencode'
brew 'powerlevel10k'
brew 'pyenv'
brew 'rsync'
brew 'stow'
brew 'saml2aws'
brew 'talisman'
brew 'terraform'
brew 'tmux'
brew 'vim'
brew 'wget'
brew 'yazi'
brew 'zoxide'
brew 'zsh'




cask '1password'
cask '1password-cli'
cask 'aldente'
cask 'aws-vpn-client'
cask 'beekeeper-studio'
cask 'clocker'
cask 'font-meslo-lg-nerd-font'
cask 'ghostty'
cask 'microsoft-auto-update'
cask 'microsoft-office'
cask 'microsoft-remote-desktop'
cask 'microsoft-teams'
cask 'ollama-app', restart_service: :changed
cask 'rancher'
cask 'slack'
cask 'spotify'
cask 'todoist-app'
cask 'visual-studio-code'
cask 'zen'
cask 'zoom'

# VSCode extensions
is_vscode_installed = !`PATH="/opt/homebrew/bin:/usr/local/bin:${PATH}" which code`.chomp.empty?
if is_vscode_installed
  vscode 'alefragnani.bookmarks'
  vscode 'alefragnani.project-manager'
  vscode 'asvetliakov.vscode-neovim'
  vscode 'brandonkirbyson.vscode-animations'
  vscode 'davidanson.vscode-markdownlint'
  vscode 'dbaeumer.vscode-eslint'
  vscode 'drcika.apc-extension'
  vscode 'editorconfig.editorconfig'
  vscode 'esbenp.prettier-vscode'
  vscode 'google.geminicodeassist'
  vscode 'hashicorp.terraform'
  vscode 'mechatroner.rainbow-csv'
  vscode 'ms-azuretools.vscode-containers'
  vscode 'ms-python.debugpy'
  vscode 'ms-python.python'
  vscode 'ms-python.vscode-pylance'
  vscode 'ms-python.vscode-python-envs'
  vscode 'vscode-icons-team.vscode-icons'
  vscode 'vspacecode.whichkey'

end
